XML/Public/GETBANKDAYBOOKS-PBQB01/request_pre/2022年3月1日/body_GETBANKDAYBOOKS-PBQB01_request_pre_20220301203648.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0>
         <![CDATA[
                <MBS>
                <pub>
                    <SRCOUTSYSTEMCODE>NC</SRCOUTSYSTEMCODE>
                    <SRCBATCHNO>temp20210407</SRCBATCHNO>
                    <TRANSCODE>PBQB01</TRANSCODE>
                    <TRANSDATETIME>2021-04-07 08:20:10</TRANSDATETIME>
                    <MD5>158cfd893b0598f078f7efa4e6b11696</MD5>
                </pub>
                <req>
                <head>
                    <COMMANDCODE>GETBANKDAYBOOKS</COMMANDCODE>
                    <PAGEINDEX>1</PAGEINDEX>
                    <PAGESIZE>100</PAGESIZE>
                </head>
                <searchconditions>
                    <ORGCODE>001000</ORGCODE>
                    <BANKACCOUNTNUMBER>771771771771</BANKACCOUNTNUMBER>
                    <MONEYWAY>2</MONEYWAY>
                    <ISCHECK>0</ISCHECK>
                    <CLAIMSTATE>1</CLAIMSTATE>
                    <TRADEDATESTART>2021-04-01</TRADEDATESTART>
                    <TRADEDATEEND>2021-04-06</TRADEDATEEND>
                </searchconditions>
                </req>
            </MBS>
            ]]>
        </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>